Revit 2026 API

# Location Class

---

Provides location functionality for all elements.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLocation Autodesk.Revit.DBLocationCurve Autodesk.Revit.DBLocationPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Location : APIObject
```
```vb
Public Class Location
	Inherits APIObject
```
```cpp
public ref class Location : public APIObject
```
```fsharp
type Location =
    class
        inherit APIObject
    end
```

The Location type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Move | Move the element within the project by a specified vector. |
|  | Rotate | Rotate the element within the project by a specified angle around a given axis. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The location object provides the ability to translate and rotate elements. More detailed location information and control can be found by using the derivatives of this object, such as LocationPoint or LocationCurve.

#### Reference

Autodesk.Revit.DB Namespace